from time import*
from random import*
print("         >>欢迎使用智能计算器<<")
print("提示：此计算器只能计算整数，不能计算小数！！！！")
while True:
    print("输入1可计算，输入2可计算数的平方/立方，输入3可单位换算，输入4可计算bmi指数（身体质量指数），输入5可进入速算挑战，输入6可退出计算器程序")
    a = input("")
    if a =="1":
        a11 = input("请输入第一个数字: ")
        a12 = input("请输入第二个数字: ")
        a11 = int(a11)
        a12 = int(a12)
        a13 = input("请输入类型:(1.加法，2.减法，3.乘法，4.除法): ")
        if a13 =="1":
            a14 = a11 + a12
            print("答案是：",a14)
        elif a13 =="2":
            a15 = a11 - a12
            print("答案是：",a15)
        elif a13 =="3":
            a16 = a11 * a12
            print("答案是：",a16)
        elif a13 =="4":
            a17 = input("请选择除法类型：(1.普通计算，2.取余数，3.取整数):")
            if a17 =="1":
                a18 = a11/a12
                print("答案是：",a18)
            elif a17 =="2":
                a19 = a11%a12
                print("答案是：",a19)
            elif a17 =="3":
                a110 = a11//a12
                print("答案是：",a110)
            else:
                print("没有此选项(´^｀)！")
        else:
            print("没有此选项(´^｀)！")
    elif a =="2":
        print("输入1算平方，输入2算立方")
        a21 = input("")
        if a21 =="1":
            a22 = input("请输入您要计算的平方数：")
            a22 = int(a22)
            a23 = a22*a22
            print(a22,"的平方数是：",a23)
        elif a21 =="2":
            a24 = input("请输入您要计算的立方数：")
            a24 = int(a24)
            a25 = a24*a24*a24
            print(a24,"的立方数是：",a25)
        else:
            print("没有此选项(´^｀)！")
    elif a =="3":
        print("正在调整到外部程序，请稍后。。。")
        sleep(10)
        print("         >>欢迎使用单位换算计算器<<")
        while True:
            a7 = input("请问您要换算什么类型的数（1-长度单位 2-面积单位 3-体积单位 4-容积单位 5-重量单位 6-退出）：")
            if a7 =="1":
                a7s1 = input("请输入要换算的数：")
                a7s1 = int(a7s1)
                a71 = input("您要换算的数的单位是什么（1-千米(公里) 2-米 3-分米 4-厘米 5-毫米）：")
                if a71 =="1":
                    a711 = input("您想要换算的数的单位是什么（1-千米(公里) 2-米 3-分米 4-厘米 5-毫米）：")
                    if a711 =="1":
                        print(a7s1,"千米（公里）=",a7s1,"千米（公里）")
                    elif a711 =="2":
                        a7112 = a7s1*1000
                        print(a7s1,"千米（公里）=",a712,"米")
                    elif a711 =="3":
                        a7113 = a7s1*1000*10
                        print(a7s1,"千米（公里）=",a7113,"分米")
                    elif a711 =="4":
                        a7114 = a7s1*1000*10*10
                        print(a7s1,"千米（公里）=",a7114,"厘米")
                    elif a711 =="5":
                        a7115 = a7s1*1000*10*10*10
                        print(a7s1,"千米（公里）=",a7115,"毫米")
                    else:
                        print("没有此选项(´^｀)！")
                elif a71 =="2":
                    a712 = input("您想要换算的数的单位是什么（1-千米(公里) 2-米 3-分米 4-厘米 5-毫米）：")
                    if a712 =="1":
                        a7121 = a7s1/1000
                        print(a7s1,"米=",a7121,"千米（公里）")
                    elif a712 =="2":
                        print(a7s1,"米=",a7s1,"米")
                    elif a712 =="3":
                        a7123 = a7s1*10
                        print(a7s1,"米=",a7123,"分米")
                    elif a712 =="4":
                        a7124 = a7s1*10*10
                        print(a7s1,"米=",a7124,"厘米")
                    elif a712 =="5":
                        a7125 = a7s1*10*10*10
                        print(a7s1,"米=",a7125,"毫米")
                    else:
                        print("没有此选项(´^｀)！")
                elif a71 =="3":
                    a713 = input("您想要换算的数的单位是什么（1-千米(公里) 2-米 3-分米 4-厘米 5-毫米）：")
                    if a713 =="1":
                        a7131 = a7s1/1000/10
                        print(a7s1,"分米=",a7131,"千米（公里）")
                    elif a713 =="2":
                        a7132 = a7s1/10
                        print(a7s1,"分米=",a7132,"米")
                    elif a713 =="3":
                        a7133 = a7s1
                        print(a7s1,"分米=",a7133,"分米")
                    elif a713 =="4":
                        a7134 = a7s1*10
                        print(a7s1,"分米=",a7134,"厘米")
                    elif a713 =="5":
                        a7135 = a7s1*10*10
                        print(a7s1,"分米=",a7135,"毫米")
                    else:
                        print("没有此选项(´^｀)！")
                elif a71 =="4":
                    a714 = input("您想要换算的数的单位是什么（1-千米(公里) 2-米 3-分米 4-厘米 5-毫米）：")
                    if a714 =="1":
                        a7141 = a7s1/1000/10/10
                        print(a7s1,"厘米=",a7141,"千米（公里）")
                    elif a714 =="2":
                        a7142 = a7s1/10/10
                        print(a7s1,"厘米=",a7142,"米")
                    elif a714 =="3":
                        a7143 = a7s1/10
                        print(a7s1,"厘米=",a7143,"分米")
                    elif a714 =="4":
                        a7144 = a7s1
                        print(a7s1,"厘米=",a7144,"厘米")
                    elif a714 =="5":
                        a7145 = a7s1*10
                        print(a7s1,"厘米=",a7145,"毫米")
                    else:
                        print("没有此选项(´^｀)！")
                elif a71 =="5":
                    a715 = input("您想要换算的数的单位是什么（1-千米(公里) 2-米 3-分米 4-厘米 5-毫米）：")
                    if a715 =="1":
                        a7151 = a7s1/1000/10/10/10
                        print(a7s1,"毫米=",a7151,"千米（公里）")
                    elif a715 =="2":
                        a7152 = a7s1/10/10/10
                        print(a7s1,"毫米=",a7152,"米")
                    elif a715 =="3":
                        a7153 = a7s1/10/10
                        print(a7s1,"毫米=",a7153,"分米")
                    elif a715 =="4":
                        a7154 = a7s1/10
                        print(a7s1,"厘米=",a7154,"厘米")
                    elif a715 =="5":
                        a7155 = a7s1
                        print(a7s1,"厘米=",a7155,"毫米")
                    else:
                        print("没有此选项(´^｀)！")
                else:
                    print("没有此选项(´^｀)！")
            elif a7 == "2":
                a7s1 = input("请输入要换算的数：")
                a7s1 = int(a7s1)
                a72 = input("您要换算的数的单位是什么（1-平方千米 2-公顷 3-平方米 4-平方分米 5-平方厘米）：")
                if a72 =="1":
                    a721 = input("您想要换算的数的单位是什么（1-平方千米 2-公顷 3-平方米 4-平方分米 5-平方厘米）：")
                    if a721 =="1":
                        a7211 = a7s1
                        print(a7s1,"平方千米=",a7211,"平方千米")
                    elif a721 =="2":
                        a7212 = a7s1*100
                        print(a7s1,"平方千米=",a7212,"公顷")
                    elif a721 =="3":
                        a7213 = a7s1*100*10000
                        print(a7s1,"平方千米=",a7213,"平方米")
                    elif a721 =="4":
                        a7214 = a7s1*100*10000*100
                        print(a7s1,"平方千米=",a7214,"平方分米")
                    elif a721 =="5":
                        a7215 = a7s1*100*10000*100*100
                        print(a7s1,"平方千米=",a7215,"平方厘米")
                    else:
                        print("没有此选项(´^｀)！")
                elif a72 =="2":
                    a722 = input("您想要换算的数的单位是什么（1-平方千米 2-公顷 3-平方米 4-平方分米 5-平方厘米）：")
                    if a722 =="1":
                        a7221 = a7s1/100
                        print(a7s1,"公顷=",a7221,"平方千米")
                    elif a722 =="2":
                        a7222 = a7s1
                        print(a7s1,"公顷=",a7222,"公顷")
                    elif a722 =="3":
                        a7223 = a7s1*10000
                        print(a7s1,"公顷=",a7223,"平方米")
                    elif a722 =="4":
                        a7224 = a7s1*10000*100
                        print(a7s1,"公顷=",a7224,"平方分米")
                    elif a722 =="5":
                        a7225 = a7s1*10000*100*100
                        print(a7s1,"公顷=",a7225,"平方厘米")
                    else:
                        print("没有此选项(´^｀)！")
                elif a72 =="3":
                    a723 = input("您想要换算的数的单位是什么（1-平方千米 2-公顷 3-平方米 4-平方分米 5-平方厘米）：")
                    if a723 =="1":
                        a7231 = a7s1/100/10000
                        print(a7s1,"平方米=",a7231,"平方千米")
                    elif a723 =="2":
                        a7232 = a7s1/100
                        print(a7s1,"平方米=",a7232,"公顷")
                    elif a723 =="3":
                        a7233 = a7s1
                        print(a7s1,"平方米=",a7233,"平方米")
                    elif a723 =="4":
                        a7234 = a7s1*100
                        print(a7s1,"平方米=",a7234,"平方分米")
                    elif a723 =="5":
                        a7235 = a7s1*100*100
                        print(a7s1,"平方米=",a7235,"平方厘米")
                    else:
                        print("没有此选项(´^｀)！")
                elif a72 =="4":
                    a724 = input("您想要换算的数的单位是什么（1-平方千米 2-公顷 3-平方米 4-平方分米 5-平方厘米）：")
                    if a724 =="1":
                        a7241 = a7s1/100/10000/100
                        print(a7s1,"平方分米=",a7241,"平方千米")
                    elif a724 =="2":
                        a7242 = a7s1/100/10000
                        print(a7s1,"平方分米=",a7242,"公顷")
                    elif a724 =="3":
                        a7243 = a7s1/100
                        print(a7s1,"平方分米=",a7243,"平方米")
                    elif a724 =="4":
                        a7244 = a7s1
                        print(a7s1,"平方分米=",a7244,"平方分米")
                    elif a724 =="5":
                        a7245 = a7s1*100
                        print(a7s1,"平方分米=",a7245,"平方厘米")
                    else:
                        print("没有此选项(´^｀)！")
                elif a72 =="5":
                    a725 = input("您想要换算的数的单位是什么（1-平方千米 2-公顷 3-平方米 4-平方分米 5-平方厘米）：")
                    if a725 =="1":
                        a7251 = a7s1/100/10000/100/100
                        print(a7s1,"平方分米=",a7251,"平方千米")
                    elif a725 =="2":
                        a7252 = a7s1/100/10000/100
                        print(a7s1,"平方分米=",a7252,"公顷")
                    elif a725 =="3":
                        a7253 = a7s1/100/100
                        print(a7s1,"平方分米=",a7253,"平方米")
                    elif a725 =="4":
                        a7254 = a7s1/100
                        print(a7s1,"平方分米=",a7254,"平方分米")
                    elif a725 =="5":
                        a7255 = a7s1
                        print(a7s1,"平方分米=",a7255,"平方厘米")
                    else:
                        print("没有此选项(´^｀)！")
                else:
                    print("没有此选项(´^｀)！")
            elif a7 == "3":
                a7s1 = input("请输入要换算的数：")
                a7s1 = int(a7s1)
                a73 = input("您要换算的数的单位是什么（1-立方米 2-立方分米 3-立方厘米）：")
                if a73 =="3":
                    a731 = input("您想要换算的数的单位是什么（1-立方米 2-立方分米 3-立方厘米）：")
                    if a731 =="1":
                        a7311 = a7s1
                        print(a7s1,"立方米=",a7311,"立方米")
                    elif a731 =="2":
                        a7312 = a7s1*1000
                        print(a7s1,"立方米=",a7312,"立方分米")
                    elif a731 =="3":
                        a7313 = a7s1*1000*1000
                        print(a7s1,"立方米=",a7313,"立方厘米")
                    else:
                        print("没有此选项(´^｀)！")
                elif a73 =="2":
                    a732 = input("您想要换算的数的单位是什么（1-立方米 2-立方分米 3-立方厘米）：")
                    if a732 =="1":
                        a7321 = a7s1*1000
                        print(a7s1,"立方分米=",a7321,"立方米")
                    elif a732 =="2":
                        a7322 = a7s1
                        print(a7s1,"立方分米=",a7322,"立方分米")
                    elif a732 =="3":
                        a7323 = a7s1/1000
                        print(a7s1,"立方分米=",a7323,"立方厘米")
                    else:
                        print("没有此选项(´^｀)！")
                elif a73 =="3":
                    a733 = input("您想要换算的数的单位是什么（1-立方米 2-立方分米 3-立方厘米）：")
                    if a733 =="1":
                        a7331 = a7s1*1000*1000
                        print(a7s1,"立方厘米=",a7331,"立方米")
                    elif a733 =="2":
                        a7332 = a7s1*1000
                        print(a7s1,"立方厘米=",a7332,"立方分米")
                    elif a733 =="3":
                        a7333 = a7s1
                        print(a7s1,"立方厘米=",a7333,"立方厘米")
                    else:
                        print("没有此选项(´^｀)！")
                else:
                    print("没有此选项(´^｀)！")
            elif a7 == "4":
                a7s1 = input("请输入要换算的数：")
                a7s1 = int(a7s1)
                a74 = input("您要换算的数的单位是什么（1-升 2-毫升）：")
                if a74 =="1":
                   a741 = input("您想要换算的数的单位是什么（1-升 2-毫升）：")
                   if a741 =="1":
                       a7411 = a7s1
                       print(a7s1,"升=",a7411,"升")
                   elif a741 =="2":
                       a7412 = a7s1*1000
                       print(a7s1,"升=",a7412,"毫升")
                elif a74 =="2":
                    a742 = input("您想要换算的数的单位是什么（1-升 2-毫升）：")
                    if a742 =="1":
                       a7421 = a7s1/1000
                       print(a7s1,"毫升=",a7421,"升")
                    elif a742 =="2":
                       a7422 = a7s1
                       print(a7s1,"毫升=",a7422,"毫升")
                else:
                    print("没有此选项(´^｀)！")
            elif a7 == "5":
                a7s1 = input("请输入要换算的数：")
                a7s1 = int(a7s1)
                a75 = input("您要换算的数的单位是什么（1-吨 2-千克 3-克）：")
                if a75 =="3":
                    a751 = input("您想要换算的数的单位是什么（1-吨 2-千克 3-克）：")
                    if a751 =="1":
                        a7511 = a7s1
                        print(a7s1,"吨=",a7511,"吨")
                    elif a751 =="2":
                        a7512 = a7s1*1000
                        print(a7s1,"吨=",a7512,"千克")
                    elif a751 =="3":
                        a7513 = a7s1*1000*1000
                        print(a7s1,"吨=",a7513,"克")
                    else:
                        print("没有此选项(´^｀)！")
                elif a75 =="2":
                    a752 = input("您想要换算的数的单位是什么（1-吨 2-千克 3-克）：")
                    if a732 =="1":
                        a7521 = a7s1*1000
                        print(a7s1,"千克=",a7521,"吨")
                    elif a752 =="2":
                        a7522 = a7s1
                        print(a7s1,"千克=",a7522,"千克")
                    elif a752 =="3":
                        a7523 = a7s1/1000
                        print(a7s1,"千克=",a7523,"克")
                    else:
                        print("没有此选项(´^｀)！")
                elif a75 =="3":
                    a753 = input("您想要换算的数的单位是什么（1-吨 2-克 3-克）：")
                    if a753 =="1":
                        a7531 = a7s1*1000*1000
                        print(a7s1,"克=",a7531,"吨")
                    elif a753 =="2":
                        a7532 = a7s1*1000
                        print(a7s1,"克=",a7532,"千克")
                    elif a753 =="3":
                        a7533 = a7s1
                        print(a7s1,"克=",a7533,"克")
                    else:
                        print("没有此选项(´^｀)！")
                else:
                    print("没有此选项(´^｀)！")
            elif a7 =="6":
                break
            else:
                print("没有此选项(´^｀)！")
    elif a =="4":
        print("正在调整到外部程序，请稍后。。。")
        sleep(10)
        print("         >>欢迎使用身体健康指数计算器<<")
        a61 = input("请输入身高（厘米）（注意：请抹去小数，不然无效）：")
        a62 = input("请输入体重（千克）（注意：请抹去小数，不然无效）：")
        a61 = int(a61)
        a62 = int(a62)
        a63 = a62/((a61/100)*(a61/100))
        print("你的健康指数是： %0.2f 请记住这个数字，并查查身体健康情况吧！(案1可立即查看身体健康情况，案2不查看)" % a63)
        a64 = input("")
        if a64 =="1":
            print("       请稍后。。。")
            sleep(5)
            if a63 <= 18:
                print("你的身体偏瘦，注意你的饮食!!")
            if 18 < a63 <=24:
                print("你的身体很正常。")
            if 24 < a63 <= 27:
                print("你的身体超重了！！o(╥﹏╥)o")
            if 27 < a63 <= 30:
                print("你的身体肥胖，注意减肥，不要吃太多!!")
            if a63 > 30:
                print("你的身体严重肥胖，注意减肥，不要吃太多，在这样下去，你可能得“三高”!!")
        elif a64 =="2":
            pass
        else:
            print("没有此选项(´^｀)！")
    elif a =="5":
        print("正在调整到外部程序，请稍后。。。")
        sleep(10)
        print("         >>欢迎使用速算挑战功能<<")
        a51 = input("请输入要挑战的次数：")
        a51 = int(a51)
        for i in range(a51):
            a52 = input("请选择难度（加法初级-1 加法中级-2 加法高级-3 减法初级-4 减法中级-5 减法高级-6 乘法初级-7 乘法高级-8 乘法挑战级-9）")
            if a52 == "1":
                a410 = input('你想挑战的题目数量是：')
                a410 = int(a410)
                a45 = 0
                print('5秒钟后开始，请做好准备！')
                a41 = 5
                for n in range(5):
                    print("        ",a41)
                    a41 = a41 - 1
                    sleep(1)
                    a42 = time()
                for i in range(a410):
                    a46 = randint(1,10)
                    a47 = randint(1,10)
                    a49 = a46 + a47
                    print('第',i+1,'道题为：',a46,'+',a47,'=')
                    a48 = input('你的答案为：')
                    a48=int(a48)
                    if a48 == a49:
                        print('回答正确！')
                        a45 = a45 + 1
                    else:
                        print("回答错误,正确答案是:",a49,"！")
                a43 = time()
                a44 = a43 - a42
                print('你答对题目总数为：',a45,',共用时：',a44,'秒！')
            elif a52 =="2":
                a410 = input('你想挑战的题目数量是：')
                a410 = int(a410)
                a45 = 0
                print('5秒钟后开始，请做好准备！')
                a41 = 5
                for n in range(5):
                    print("        ",a41)
                    a41 = a41 - 1
                    sleep(1)
                    a42 = time()
                for i in range(a410):
                    a46 = randint(10,100)
                    a47 = randint(10,100)
                    a49 = a46 + a47
                    print('第',i+1,'道题为：',a46,'+',a47,'=')
                    a48 = input('你的答案为：')
                    a48=int(a48)
                    if a48 == a49:
                        print('回答正确！')
                        a45 = a45 + 1
                    else:
                        print("回答错误,正确答案是:",a49,"！")
                a43 = time()
                a44 = a43 - a42
                print('你答对题目总数为：',a45,',共用时：',a44,'秒！')
            elif a52 =="3":
                a410 = input('你想挑战的题目数量是：')
                a410 = int(a410)
                a45 = 0
                print('5秒钟后开始，请做好准备！')
                a41 = 5
                for n in range(5):
                    print("        ",a41)
                    a41 = a41 - 1
                    sleep(1)
                    a42 = time()
                for i in range(a410):
                    a46 = randint(0,10000)
                    a47 = randint(0,10000)
                    a49 = a46 + a47
                    print('第',i+1,'道题为：',a46,'+',a47,'=')
                    a48 = input('你的答案为：')
                    a48=int(a48)
                    if a48 == a49:
                        print('回答正确！')
                        a45 = a45 + 1
                    else:
                        print("回答错误,正确答案是:",a49,"！")
                a43 = time()
                a44 = a43 - a42
                print('你答对题目总数为：',a45,',共用时：',a44,'秒！')
            elif a52 =="4":
                a410 = input('你想挑战的题目数量是：')
                a410 = int(a410)
                a45 = 0
                print('5秒钟后开始，请做好准备！')
                a41 = 5
                for n in range(5):
                    print("        ",a41)
                    a41 = a41 - 1
                    sleep(1)
                    a42 = time()
                for i in range(a410):
                    a46 = randint(5,10)
                    a47 = randint(0,5)
                    a49 = a46 - a47
                    print('第',i+1,'道题为：',a46,'-',a47,'=')
                    a48 = input('你的答案为：')
                    a48=int(a48)
                    if a48 == a49:
                        print('回答正确！')
                        a45 = a45 + 1
                    else:
                        print("回答错误,正确答案是:",a49,"！")
                a43 = time()
                a44 = a43 - a42
                print('你答对题目总数为：',a45,',共用时：',a44,'秒！')
            elif a52 =="5":
                a410 = input('你想挑战的题目数量是：')
                a410 = int(a410)
                a45 = 0
                print('5秒钟后开始，请做好准备！')
                a41 = 5
                for n in range(5):
                    print("        ",a41)
                    a41 = a41 - 1
                    sleep(1)
                    a42 = time()
                    for i in range(a410):
                        a46 = randint(50,100)
                        a47 = randint(0,50)
                        a49 = a46 - a47
                        print('第',i+1,'道题为：',a46,'-',a47,'=')
                        a48 = input('你的答案为：')
                        a48=int(a48)
                    if a48 == a49:
                        print('回答正确！')
                        a45 = a45 + 1
                    else:
                        print("回答错误,正确答案是:",a49,"！")
                a43 = time()
                a44 = a43 - a42
                print('你答对题目总数为：',a45,',共用时：',a44,'秒！')
            elif a52 =="6":
                a410 = input('你想挑战的题目数量是：')
                a410 = int(a410)
                a45 = 0
                print('5秒钟后开始，请做好准备！')
                a41 = 5
                for n in range(5):
                    print("        ",a41)
                    a41 = a41 - 1
                    sleep(1)
                    a42 = time()
                for i in range(a410):
                    a46 = randint(5000,10000)
                    a47 = randint(0,5000)
                    a49 = a46 - a47
                    print('第',i+1,'道题为：',a46,'-',a47,'=')
                    a48 = input('你的答案为：')
                    a48=int(a48)
                    if a48 == a49:
                        print('回答正确！')
                        a45 = a45 + 1
                    else:
                        print("回答错误,正确答案是:",a49,"！")
                a43 = time()
                a44 = a43 - a42
                print('你答对题目总数为：',a45,',共用时：',a44,'秒！')
            elif a52 =="7":
                a410 = input('你想挑战的题目数量是：')
                a410 = int(a410)
                a45 = 0
                print('5秒钟后开始，请做好准备！')
                a41 = 5
                for n in range(5):
                    print("        ",a41)
                    a41 = a41 - 1
                    sleep(1)
                    a42 = time()
                for i in range(a410):
                    a46 = randint(1,10)
                    a47 = randint(0,10)
                    a49 = a46 * a47
                    print('第',i+1,'道题为：',a46,'x',a47,'=')
                    a48 = input('你的答案为：')
                    a48=int(a48)
                    if a48 == a49:
                        print('回答正确！')
                        a45 = a45 + 1
                    else:
                        print("回答错误,正确答案是:",a49,"！")
                a43 = time()
                a44 = a43 - a42
                print('你答对题目总数为：',a45,',共用时：',a44,'秒！')
            elif a52 =="8":
                a410 = input('你想挑战的题目数量是：')
                a410 = int(a410)
                a45 = 0
                print('5秒钟后开始，请做好准备！')
                a41 = 5
                for n in range(5):
                    print("        ",a41)
                    a41 = a41 - 1
                    sleep(1)
                    a42 = time()
                for i in range(a410):
                    a46 = randint(1,100)
                    a47 = randint(0,100)
                    a49 = a46 * a47
                    print('第',i+1,'道题为：',a46,'x',a47,'=')
                    a48 = input('你的答案为：')
                    a48=int(a48)
                    if a48 == a49:
                        print('回答正确！')
                        a45 = a45 + 1
                    else:
                        print("回答错误,正确答案是:",a49,"！")
                a43 = time()
                a44 = a43 - a42
                print('你答对题目总数为：',a45,',共用时：',a44,'秒！')
            elif a52 =="9":
                a410 = input('你想挑战的题目数量是：')
                a410 = int(a410)
                a45 = 0
                print('5秒钟后开始，请做好准备！')
                a41 = 5
                for n in range(5):
                    print("        ",a41)
                    a41 = a41 - 1
                    sleep(1)
                    a42 = time()
                for i in range(a410):
                    a46 = randint(0,10000000000)
                    a47 = randint(0,10000000000)
                    a49 = a46 * a47
                    print('第',i+1,'道题为：',a46,'x',a47,'=')
                    a48 = input('你的答案为：')
                    a48=int(a48)
                    if a48 == a49:
                        print('回答正确！')
                        a45 = a45 + 1
                    else:
                        print("回答错误,正确答案是:",a49,"！")
                a43 = time()
                a44 = a43 - a42
                print('你答对题目总数为：',a45,',共用时：',a44,'秒！')
            else:
                print("没有此选项(´^｀)！")
    elif a =="6":
        break
    else:
        print("没有此选项(´^｀)！")