print("  ************************************** ")
print("  *****   大答题活动题现在开始!!!  ******* ")
print("  ************************************** ")
print("用大写回答，否则算错")
print(" （共20题，1题5分）")
print("开始答题！")
print("第1题：“落木千山天远大，澄江一道月分明。”的作者是谁？")
print("A.王维  B.陶渊明  C.王驾  D.黄庭坚")
a1 = input("请回答第1题:")
if a1 == "D":
    print("答对了，你太棒了！")
    s1 = 5
if a1 !="D":
    print("答错了，继续努力吧!")
    s1 = 0
print("第2题：【父亲的菜园】的作者是谁？")
print("A.王春  B.袁学团  C.王树槐  D.黄爱萍")
a2 = input("请回答第2题:")
if a2 == "C":
    print("答对了，你太棒了！")
    s2 = 5
if a2 !="C":
    print("答错了，继续努力吧!")
    s2 = 0
print("第3题：非常的相信叫什么？")
print("A.深信  B.笃信  C.取信 D.诚信")
a3 = input("请回答第3题:")
if a3== "A":
    print("答对了，你太棒了！")
    s3 = 5
if a3 !="A":
    print("答错了，继续努力吧!")
    s3 = 0
print("第4题：【乡村四月】这首诗描写了什么季节？")
print("A.春天  B.夏天  C.秋天 D.冬天")
a4 = input("请回答第4题:")
if a4== "B":
    print("答对了，你太棒了！")
    s4 = 5
if a4 !="B":
    print("答错了，继续努力吧!")
    s4 = 0
print("第5题：【乡村四月】作者是谁？")
print("A.李白  B.翁卷  C.苏轼 D.王维")
a5 = input("请回答第5题:")
if a5== "B":
    print("答对了，你太棒了！")
    s5 = 5
if a5!="B":
    print("答错了，继续努力吧!")
    s5 = 0
print("第6题：下列成语书写完全正确的一组是（      ） ")
print("A  运筹维幄   腹背受敌   草木皆兵   风声鹤立")
print("B  与世长辞   多资多彩   清香袅袅   重见天日")
print("C  傲然挺立   幽然自得   不加思索   栩栩如生")
print("D  怦然一震   辽阔无垠   膘肥体壮   花繁叶茂")
a6 = input("请回答第6题:")
if a6== "D":
    print("答对了，你太棒了！")
    s6 = 5
if a6!="D":
    print("答错了，继续努力吧!")
    s6 = 0
print("第7题：“美是到处都有的。对于我们的眼睛，不是缺少美，而是缺少发现。”这句话是法国著名雕塑家罗丹说的。")
print("A.× B.√")
a7 = input("请回答第7题:")
if a7== "B":
    print("答对了，你太棒了！")
    s7 = 5
if a7!="B":
    print("答错了，继续努力吧!")
    s7 = 0
print("不出门，晚霞行千里。")
print("C.己所不欲，勿施于人。 D.采菊东篱下，悠然见南山。")
a8 = input("请回答第8题:")
if a8== "A":
    print("答对了，你太棒了！")
    s8 = 5
if a8 !="A":
    print("答错了，继续努力吧!")
    s8 = 0
print("第9题:与“春江水暖鸭先知”对应的一项是（     ）")
print("A.竹外桃花三两枝  B.独出前门望野田  C.黄梅时节家家雨 ")
a9 = input("请回答第9题:")
if a9== "A":
    print("答对了，你太棒了！")
    s9 = 5
if a9!="A":
    print("答错了，继续努力吧!")
    s9 = 0
print("第10题:在我国的无数名山中，有五座山因为景色独特、富有文化内涵被称为“五岳”，其中“中岳”是（      ）")
print(" A.衡山 B.泰山 C.嵩山")
a10 = input("请回答第10题:")
if a10== "C":
    print("答对了，你太棒了！")
    s10 = 5
if a10!="C":
    print("答错了，继续努力吧!")
    s10 = 0
print("第11题:“自强不息”“持之以恒”“雄心壮志”都是形容人的精神和意志的成语。")
print("A.× B.√")
a11 = input("请回答第11题:")
if a10== "B":
    print("答对了，你太棒了！")
    s11 = 5
if a10!="B":
    print("答错了，继续努力吧!")
    s11 = 0
print("第12题:普罗米修斯是古希腊神话中的一个神。")
print("A.× B.√")
a12 = input("请回答第12题:")
if a12== "B":
    print("答对了，你太棒了！")
    s12 = 5
if a12!="B":
    print("答错了，继续努力吧!")
    s12 = 0
print("第13题:即使发展到肠胃里，服几剂汤药也还能治好。”一句中的关联词语使用正确。")
print("A.× B.√")
a13 = input("请回答第13题:")
if a13== "B":
    print("答对了，你太棒了！")
    s13 = 5
if a13!="B":
    print("答错了，继续努力吧!")
    s13 = 0
print("第14题:“爱人者，人恒爱之；敬人者，人恒敬之”这句话出自（  ）")
print(" A《论语•子路》B《孟子•梁惠王上》C《孟子•离娄下》D《论语•颜渊》")
a14 = input("请回答第14题:")
if a14== "C":
    print("答对了，你太棒了！")
    s14 = 5
if a14!="C":
    print("答错了，继续努力吧!")
    s14 = 0
print("第15题:你的朋友和你约定星期六一起去爬山，可到了那天他没去，你会用下面哪句名言来提醒他，做人要遵守诺言。（　　　）。")
print("Ａ．精诚所至，金石为开。Ｂ．与朋友交，言而有信。Ｃ．有志者事竟成。Ｄ．已所不欲，勿施于人。")
a15 = input("请回答第15题:")
if a15== "B":
    print("答对了，你太棒了！")
    s15 = 5
if a15!="B":
    print("答错了，继续努力吧!")
    s15 = 0
print("第16题:下列诗句中赞美春日景色的一项是（　　　　）。")
print("Ａ．几行红叶树，无数夕阳山。")
print("Ｂ．湖光秋月两相和，潭面无风镜未磨。")
print("Ｃ．日出江花红胜火，春来江水绿如蓝。")
a16 = input("请回答第16题:")
if a16== "C":
    print("答对了，你太棒了！")
    s16 = 5
if a16!="C":
    print("答错了，继续努力吧!")
    s16 = 0
print("第17题:下列句子中没有使用修辞手法的一项是（　　　　）。")
print("Ａ．桂林的山真险啊，好像一不小心就会栽倒下来。")
print("Ｂ．空旷的花园里，烧焦的树垂头丧气地弯着腰。")
print("Ｃ．漓江的水真绿啊，绿得仿佛那是一块无暇的翡翠")
print("Ｄ．不再胆怯的小白菊，慢慢地抬起它们的头。")
a17 = input("请回答第17题:")
if a17== "A":
    print("答对了，你太棒了！")
    s17 = 5
if a17!="A":
    print("答错了，继续努力吧!")
    s17 = 0
print("第18题:“他在学校念书的时候，同学们就称他为‘辩论家’。”这句话中的引号表示特定称谓")
print("A.× B.√")
a18 = input("请回答第18题:")
if a18== "A":
    print("答对了，你太棒了！")
    s18 = 5
if a18!="A":
    print("答错了，继续努力吧!")
    s18 = 0
print("第19题:《记金华的双龙洞》是叶圣陶写的一篇游记，作者按游览的顺序，描写了入山、洞口、外洞、内洞、孔隙、出洞的过程。")
print("A.× B.√")
a19 = input("请回答第19题:")
if a19== "B":
    print("答对了，你太棒了！")
    s19 = 5
if a19!="B":
    print("答错了，继续努力吧!")
    s19 = 0
print("第20题:《一个中国孩子的呼声》是书信体文章。")
print("A.× B.√")
a20 = input("请回答第20题:")
if a20== "B":
    print("答对了，你太棒了！")
    s20 = 5
if a20!="B":
    print("答错了，继续努力吧!")
    s20 = 0
s = s1 + s2 + s3 + s4 + s5 + s6 + s7 + s8 + s9 + s10 + s11 + s12 + s13 + s14 + s15 + s16 + s17 + s18 + s20 + s19
print("答题结束，您获得",s,"分，测试题答案是 DCABBDBAACBBBCBCAAB")